main_menu = '''\nГлавное меню:   
    1. Открыть файл
    2. Сохранить файл
    3. Показать контакт
    4. Добавитьт контакт
    5. Найтии контакт
    6. Изменить контакт
    7. Удалить контакт
    8. Выход\n'''

input_choice = ' Выберете пункт меню: '

load_successful = 'Телефонная книга успешно открыта!'

pb_empty = ' Телефонная книга пуста или не загружена!'
input_new_contact = 'Введите данные нового кoнтакта: '
new_contact = {'name': 'Введите имя: ',
               'phone': 'Введите номер телефона: ',
               'comment': 'Введите комментарий: '}


def new_contact_successful(name: str):
    return f'Контакт {name} успешно добавлен'

save_successful = ' Телефонная книга успешно сохранена!'


input_search = 'Что будем искать?  '
def empty_search(word)->str:
    return f'Контакты содержащие слово "{word}" не найден.'


input_change = 'Какой контакт будем менять?  '

change_contact = 'Введите новые данные или оставьте поле пустым, что бы не менять:  '

input_index = 'Введите индекс контакта: '
def change_succ(name: str)->str:
    return f'Контакт {name} успешно изменен!'

delet_cont = 'Контакт успешно удален! '